import type { StyleDefinition } from '../types';

const barsMap: Record<string, string> = {
  A: 'Ǎ̵̵͓̫̲̭͔̄̄̈́͟͞', B: 'B̵̵͓̫̲̭͔̌̄̄̈́͟͞', C: 'Č̵̵͓̫̲̭͔̄̄̈́͟͞', D: 'Ď̵̵͓̫̲̭͔̄̄̈́͟͞', E: 'Ě̵̵͓̫̲̭͔̄̄̈́͟͞', F: 'F̵̵͓̫̲̭͔̌̄̄̈́͟͞',
  G: 'Ǧ̵̵͓̫̲̭͔̄̄̈́͟͞', H: 'Ȟ̵̵͓̫̲̭͔̄̄̈́͟͞', I: 'Ǐ̵̵͓̫̲̭͔̄̄̈́͟͞', J: 'J̵̵͓̫̲̭͔̌̄̄̈́͟͞', K: 'Ǩ̵̵͓̫̲̭͔̄̄̈́͟͞', L: 'Ľ̵̵͓̫̲̭͔̄̄̈́͟͞',
  M: 'M̵̵͓̫̲̭͔̌̄̄̈́͟͞', N: 'Ň̵̵͓̫̲̭͔̄̄̈́͟͞', O: 'Ǒ̵̵͓̫̲̭͔̄̄̈́͟͞', P: 'P̵̵͓̫̲̭͔̌̄̄̈́͟͞', Q: 'Q̵̵͓̫̲̭͔̌̄̄̈́͟͞', R: 'Ř̵̵͓̫̲̭͔̄̄̈́͟͞',
  S: 'Š̵̵͓̫̲̭͔̄̄̈́͟͞', T: 'Ť̵̵͓̫̲̭͔̄̄̈́͟͞', U: 'Ǔ̵̵͓̫̲̭͔̄̄̈́͟͞', V: 'V̵̵͓̫̲̭͔̌̄̄̈́͟͞', W: 'W̵̵͓̫̲̭͔̌̄̄̈́͟͞', X: 'X̵̵͓̫̲̭͔̌̄̄̈́͟͞',
  Y: 'Y̵̵͓̫̲̭͔̌̄̄̈́͟͞', Z: 'Ž̵̵͓̫̲̭͔̄̄̈́͟͞', a: 'ǎ̵̵͓̫̲̭͔̄̄̈́͟͞', b: 'b̵̵͓̫̲̭͔̌̄̄̈́͟͞', c: 'č̵̵͓̫̲̭͔̄̄̈́͟͞', d: 'ď̵̵͓̫̲̭͔̄̄̈́͟͞',
  e: 'ě̵̵͓̫̲̭͔̄̄̈́͟͞', f: 'f̵̵͓̫̲̭͔̌̄̄̈́͟͞', g: 'ǧ̵̵͓̫̲̭͔̄̄̈́͟͞', h: 'ȟ̵̵͓̫̲̭͔̄̄̈́͟͞', i: 'ǐ̵̵͓̫̲̭͔̄̄̈́͟͞', j: 'ǰ̵̵͓̫̲̭͔̄̄̈́͟͞',
  k: 'ǩ̵̵͓̫̲̭͔̄̄̈́͟͞', l: 'ľ̵̵͓̫̲̭͔̄̄̈́͟͞', m: 'm̵̵͓̫̲̭͔̌̄̄̈́͟͞', n: 'ň̵̵͓̫̲̭͔̄̄̈́͟͞', o: 'ǒ̵̵͓̫̲̭͔̄̄̈́͟͞', p: 'p̵̵͓̫̲̭͔̌̄̄̈́͟͞',
  q: 'q̵̵͓̫̲̭͔̌̄̄̈́͟͞', r: 'ř̵̵͓̫̲̭͔̄̄̈́͟͞', s: 'š̵̵͓̫̲̭͔̄̄̈́͟͞', t: 'ť̵̵͓̫̲̭͔̄̄̈́͟͞', u: 'ǔ̵̵͓̫̲̭͔̄̄̈́͟͞', v: 'v̵̵͓̫̲̭͔̌̄̄̈́͟͞',
  w: 'w̵̵͓̫̲̭͔̌̄̄̈́͟͞', x: 'x̵̵͓̫̲̭͔̌̄̄̈́͟͞', y: 'y̵̵͓̫̲̭͔̌̄̄̈́͟͞', z: 'ž̵̵͓̫̲̭͔̄̄̈́͟͞',
  'Ä': 'Ǎ̵̵̵̵͓̫̲̭͔͓̫̲̭͔̄̄̈́̈̌̄̄̈́͟͟͞͞', 'Ö': 'Ǒ̵̵̵̵͓̫̲̭͔͓̫̲̭͔̄̄̈́̈̌̄̄̈́͟͟͞͞', 'Ü': 'Ǔ̵̵̵̵͓̫̲̭͔͓̫̲̭͔̄̄̈́̈̌̄̄̈́͟͟͞͞',
  'ä': 'ǎ̵̵̵̵͓̫̲̭͔͓̫̲̭͔̄̄̈́̈̌̄̄̈́͟͟͞͞', 'ö': 'ǒ̵̵̵̵͓̫̲̭͔͓̫̲̭͔̄̄̈́̈̌̄̄̈́͟͟͞͞', 'ü': 'ǔ̵̵̵̵͓̫̲̭͔͓̫̲̭͔̄̄̈́̈̌̄̄̈́͟͟͞͞',
  'ß': 'ß̵̵͓̫̲̭͔̌̄̄̈́͟͞'
};

export const barsStyle: StyleDefinition = {
  name: 'Bars',
  transform: (text: string) => text.split('').map(char => barsMap[char] || char).join('')
};
