import type { StyleDefinition } from '../types';

const noisyMap: Record<string, string> = {
  A: 'A̳̳̹̟̋ͣ͌ͅ', B: 'B̛̙̙͉̬̦̻̾͛̕͟', C: 'C͖͖̮̗̗͉̔̓ͧͨ', D: 'D̷̨̥̥̥͖̞͐ͮ̄', E: 'E̢̢̻ͮͧͦ͋͞͡',
  F: 'F̼̼͓̙ͤ̋̅̚͞͞', G: 'G̯̯̩̙͆ͣ͟', H: 'H͇͇̹͊ͪ́̕ͅ', I: 'I̡̨͙͙̪̹̾͟', J: 'J̸̡̡̟͑ͭ̄͘',
  K: 'K̭̭͔͓̦̏̎͠', L: 'Ļ͓͓̣̽͟', M: 'M͚͚̻͂̇͜͟͟', N: 'N͔͔̥̺̞̿͊̇', O: 'Ơ̷̴̪̪̝͈̥͈̆̀̚',
  P: 'P̤̤͖ͪ͑̕͜͜', Q: 'Q̧̧̧̛͈̤̻̾̃͛', R: 'R̛̦̦̝̤͌̏͜͟͜', S: 'S̢̼̼͖̺͖ͪ', T: 'T̼̼̖̾͟͞',
  U: 'U̝̝̝̲̦ͣ͋͛̊', V: 'V̵̡͔͔͔̭̾̀̂̑͞', W: 'W̧̤̤͇̣̥͂͐', X: 'X̨̯̯͎̥͊̄̊͡͡ͅ', Y: 'Y̧̬̬͇̖̳̏͌͞',
  Z: 'Z̼̼̙͐̐̅͌', a: 'a͔͔̜̗̦ͩ̅̎', b: 'b͔͔̳͈̊̆ͥ͂͜͝', c: 'c̨̨̣̮̝̈́̔ͯ̀͂', d: 'd̶̵̯̯̼̘ͨ̓',
  e: 'ḛ̡̰̳͓̥ͬ͋ͪͧ', f: 'f̰̰̯͕͊̃̊͞͞͞', g: 'g̬̬̱ͩ͋͟͟', h: 'h̨͚͚͖ͯ̒̄͗͞', i: 'i̧̻̻͉̜͑ͪ̾͟',
  j: 'j̺̺̭͖̘̬̃̓ͨ', k: 'k̼̼̞̦̞̼̔', l: 'l͖͖̰̝ͭ̀͘', m: 'm̰̰̹͚̙̂ͦ͗͠', n: 'n̫̫̘̗͕̲̲̎ͥ',
  o: 'o͙͙̙̘̙ͤͫ͞', p: 'p͔͔͚͉̬̋ͩ̾͗', q: 'q͈͈͚͑ͫ̉ͤ͟', r: 'ṛ̣̬̫̍͌ͩ͟', s: 's̨̞̞̰͎͎̪̩͕̈́̀ͯ̍ͧͅ',
  t: 't͖͖̠̬͛', u: 'ụ̴̴̾̀͟͡', v: 'v̹̹̘̼̞̻͆ͩ̓ͪ͢', w: 'w̡̻̻̣͚̒̀ͅ', x: 'x͕͕͚͍̿̆͂͞',
  y: 'y͙͙̪̰ͫ͌́', z: 'z̰̰̝̿ͣ͝͡͝', 'Ä': 'A̳̳̹̟̋ͣ͌̈ͅ', 'Ö': 'Ơ̷̴̪̪̝͈̥͈̆̀̈̚', 'Ü': 'U̝̝̝̲̦ͣ͋͛̊̈',
  'ä': 'a͔͔̜̗̦ͩ̅̎̈', 'ö': 'o͙͙̙̘̙ͤͫ̈͞', 'ü': 'ụ̴̴̾̀̈͟͡', 'ß': 'ß'
};

export const noisyStyle: StyleDefinition = {
  name: 'Noisy',
  transform: (text: string) => text.split('').map(char => noisyMap[char] || char).join('')
};
