import type { StyleDefinition } from '../types';

const weirdMap: Record<string, string> = {
  A: 'Ȧ̶̵̗̳', B: 'B̟̈́̆̐̄̚͜', C: 'C̸̣̭͖̤̒̈͊͟', D: 'Ḋ̤͇̮͙ͥ', E: 'E̸̖̪̱͚ͨ̀͜', F: 'F̵̦̺͕́̐͟',
  G: 'G̛͔͇̞̹̈̀͘͘͟', H: 'H̶̪͍̒ͥ͑̓', I: 'I̶̴̗̗̦͍ͨͭ̉͢͟', J: 'J̸̧̪̫̫̩̿͗͑̇̕͟', K: 'K̦̖̙̱̮̐̌', L: 'L̳͈͉̅̊',
  M: 'M̶̷̲̊ͥ͋͟', N: 'N̰̜͉͔ͬ̽͢', O: 'O̵̷̪̰ͩ͆ͅ', P: 'P̘͎̀͊', Q: 'Q̸̨͉̰̰ͬ', R: 'Ŗ̴̪̈̄͞',
  S: 'S̵̶̮̬͖̄͑͟', T: 'T̷̫͉̰͕̒́', U: 'U̸̫̠̰͈̕', V: 'V̷̬̈ͫ͢͢͝', W: 'W̸͈ͯ̾̒̿', X: 'X̸̵̨ͦ̒ͣ',
  Y: 'Y̵̷̛̤͍̅́̕', Z: 'Z̴̨͇͖͓̋̊', a: 'ă̶̸̝ͦ͊̿͋͞', b: 'b̵̸͙̅̽͡ͅ', c: 'c̷̹͖͋́̃', d: 'd̸̡̩͍̔ͥ͜',
  e: 'ę̷̵̧̖̫̗̆̊', f: 'f̷̵̫̞̉͢', g: 'g̴̶̛̮̣͙͠', h: 'h̶̯̰̝̻̿̓͢', i: 'i̵͓͙̱͚̎͟', j: 'j̧͉̺̤̎ͯ',
  k: 'k̶̸͙̭̹͆͟', l: 'ḻ̸͈ͧ͑̓̓̀͡', m: 'm̶̷͔ͪ̽͡', n: 'n̷̶̯͉̊̽̐ͦ͘', o: 'ȍ̸̢̢̮͚̐̚', p: 'p̶̸̨̺͊̍̒̓̀',
  q: 'q̷̝ͣ͑̌͢', r: 'r̶̷̲͍̭͐̾̀͟', s: 's̩͙͖̋͛͟', t: 't̴͕͖͓̀', u: 'û̶͙̽̿͆̈', v: 'v̸̵̝͙͆̈ͤ',
  w: 'ẅ̷̷̢̟͇͈̒', x: 'x̷̶͚͖͓̘̔', y: 'y̯̤͑́́̓́', z: 'z͕͓̼̼̽̃͘', 'Ä': 'Ȧ̶̵̗̳̈', 'Ö': 'O̵̷̪̰ͩ͆̈ͅ', 'Ü': 'Ü̸̫̠̰͈̕',
  'ä': 'ă̶̸̝ͦ͊̿͋̈͞', 'ö': 'ȍ̸̢̢̮͚̐̈̚', 'ü': 'û̶͙̽̿͆̈̈', 'ß': 'ß'
};

export const weirdStyle: StyleDefinition = {
  name: 'Weird',
  transform: (text: string) => text.split('').map(char => weirdMap[char] || char).join('')
};
